Repository: UCSCLibrary/BulkMetadataEditor
Catalog: languages/*.po
Languages: it

source: Please wait
it: Attendere prego

source: Title
it: Titolo

source: Description
it: Descrizione

source: Item Type
it: Tipologia documento

source: Item
it: Documento

source: Field
it: Campo

source: Old Value
it: Vecchio valore

source: New Value
it: Nuovo valore

source: Error generating preview!
it: Errore durante la generazione dell'anteprima!

source: Apologies, but we could not generate a preview at this time.
it: Spiacenti, ma non è stato possibile generare un'anteprima questa volta.

source: You may be asking for too many changes at once.
it: Stai probabilmente richiedendo troppe modifiche in una volta sola.

source: Anyway, the bulk edition will be done in the background.
it: Comunque, la modifica massiva verrà effettuata in background.

source: The items preview request is taking too long!
it: La richiesta d'anteprima del documento sta impiegando troppo tempo!

source: You must be trying to select a ton of items at once.
it: Stai probabilmente selezionando troppi documenti in una volta sola.

source: Preview is not possible, but the bulk edition will be done in the background.
it: L'anteprima non è possibile, ma la modifica massiva verrà effettuata in background.

source: The fields preview request is taking too long!
it: La richiesta di anteprima del campo sta impiegando troppo tempo!

source: You must be trying to select a ton of fields at once.
it: Stai probabilmente selezionando troppi campi in una volta sola.

source: The changes preview request is taking too long!
it: La richiesta d'anteprima delle modifiche sta impiegando troppo tempo!

source: You must be trying to make a ton of changes at once.
it: Stai probabilmente provando a fare troppe modifiche in una volta sola.

source: Please select at least one field.
it: Seleziona almeno un campo.

source: Please select an action to perform.
it: Seleziona un'azione da effettuare

source: No matching items found.
it: Nessun documento corrispondente trovato.

source: No matching field found.
it: Nessun campo corrispondente trovato.

source: No change or no preview.
it: Nessuna modifica o anteprima.

source: Plus %s more items.
it: %s altri documenti.

source: ...and corresponding fields from a total of %s items.
it: ...e campi corrispondenti da un totale di %s documenti.

source: Only first %s changes shown.
it: Solo le prime %s modifiche sono mostrate.

source: Show more.
it: Mostra di più.

source: Preview Selected Items
it: Anteprima documenti selezionati

source: Hide Items Preview
it: Nascondi anteprima documenti

source: Preview Selected Fields
it: Anteprima campi selezionati

source: Hide Fields Preview
it: Nascondi anteprima campi

source: Preview Changes
it: Anteprima modifiche

source: Hide Changes Preview
it: Nascondi anteprima modifiche

source: Select items to edit based on the collection they are a part of
it: Seleziona i documenti da modificare in base alla collezione di cui fanno parte

source: Status
it: Stato

source: Select Items to edit based on whether they are public or not
it: Seleziona i documenti da modificare in base al fatto che siano pubblici o no

source: All Items
it: Tutti i documenti

source: Only public Items
it: Solo documenti pubblici

source: Only private Items
it: Solo documenti non pubblici

source: Select Items by Metadata
it: Seleziona per metadati

source: Select items to edit based on their associated metadata elements
it: Seleziona i documenti da modificare in base ai metadati a loro associati

source: Metadata elements
it: Elementi con metadati

source: Select the metadata elements you would like to edit; you can select multiple elements
it: Seleziona gli elementi con metadati che vorresti modificare; puoi selezionare più elementi

source: Edit Type
it: Tipologia modifica

source: Choose the type of edit you would like to perform
it: Scegli la tipologia di modifica che vuoi apportare

source: Search and replace text in the selected fields
it: Cercare e sostituire del testo nei campi selezionati

source: Add a new metadatum in the selected fields
it: Aggiungere un nuovo metadato ai campi selezionati

source: Prepend text to existing metadata in the selected fields
it: Anteporre del testo ai metadati esistenti nei campi selezionati

source: Append text to existing metadata in the selected fields
it: Posporre del testo ai metadati esistenti nei campi selezionati

source: Remove text from ends of existing metadata in the selected fields
it: Rimuovere del testo dagli estremi dei metadati esistenti nei campi selezionati

source: Convert to uppercase or lowercase existing metadata in the selected fields
it: Convertire in maiuscolo o minuscolo i metadati esistenti nei campi selezionati

source: Explode metadata with a separator in multiple elements in the selected fields
it: Separare metadati in elementi multipli nei campi selezionati

source: Deduplicate and join metadata with a separator in the selected fields
it: Eliminare duplicati e unire metadati nei campi selezionati

source: Deduplicate and remove empty metadata in the selected fields
it: Eliminare duplicati e rimuovere metadati vuoti dai campi selezionati

source: Deduplicate files of selected items by hash
it: Eliminare file duplicati dai documenti selezionati

source: Delete all existing metadata in the selected fields
it: Cancellare tutti i metadati esistenti nei campi selezionati

source: Background Job
it: Lavoro in background

source: If checked, the job will be processed in the background
it: Se selezionata, il lavoro verrà effettuato in background

source: Search for
it: Cerca

source: Input text you want to search for:
it: Inserisci il testo che vuoi cercare:

source: Regular Expression
it: Espressione regolare

source: Use regular expressions (always enclose search pattern between delimiters; visit %s for more info)
it: Usa le espressioni regolari (racchiudi sempre il testo da cercare tra delimitatori; visita %s per maggiori informazioni)

source: Replace with
it: Sostituisci con

source: Input text you want to replace with:
it: Inserisci il testo che vuoi utilizzare per la sostituzione:

source: Text to Add
it: Testo da aggiungere

source: Input text you want to add as new metadatum:
it: Inserisci il testo che vuoi aggiungere come nuovo metadato:

source: Avoid duplication
it: Evita duplicati

source: Add metadatum only if it does not already exist
it: Aggiunge il metadato solo se già non esiste

source: Text to Prepend
it: Testo da anteporre

source: Input text you want to prepend to metadata:
it: Inserisci il testo che vuoi anteporre ai metadati:

source: Text to Append
it: Testo da posporre

source: Input text you want to append to metadata:
it: Inserisci il testo che vuoi posporre ai metadati:

source: Text to Remove from left
it: Testo da rimuovere a sinistra

source: Input text you want to remove from the beginning of metadata (if empty, will remove white spaces and tabs)
it: Inserisci il testo che vuoi rimuovere dall'inizio dei metadati (se vuoto, rimuoverà spazi bianchi e tabulazioni)

source: Text to Remove from right
it: Testo da rimuovere a destra

source: Input text you want to remove from the end of metadata (if empty, will remove white spaces and tabs)
it: Inserisci il testo che vuoi rimuovere dalla fine dei metadati (se vuoto, rimuoverà spazi bianchi e tabulazioni)

source: Case conversion type
it: Tipologia conversione caratteri

source: Choose the type of case conversion for the metadata
it: Scegli il tipo di conversione caratteri per i metadati

source: all characters lowercase
it: tutti caratteri minuscoli

source: ALL CHARACTERS UPPERCASE
it: TUTTI CARATTERI MAIUSCOLI

source: First character of every sentence uppercase
it: Primo carattere di ogni frase maiuscolo

source: First Character Of Every Word Uppercase
it: Primo Carattere Di Ogni Parola Maiuscolo

source: Separator
it: Separatore

source: The separator used to explode metadata (usually ',' or ';' or '|' or any chain of characters);
it: Il separatore usato per dividere i metadati (solitamente ',' o ';' o '|' o ogni concatenazione di caratteri);

source: HTML tags will be stripped before process
it: i tag HTML verranno tolti prima dell'esecuzione

source: The separator used to join metadata (usually ',' or ';' or '|' or any chain of characters);
it: Il separatore usato per unire i metadati (solitamente ',' o ';' o '|' o ogni concatenazione di caratteri);

source: Step 1: Select Items
it: Passo 1: Seleziona Documenti

source: Step 2: Select Fields
it: Passo 2: Seleziona campi

source: Step 3: Define Changes
it: Passo 3: Definisci modifiche

source: Apply Edits Now
it: Applica modifiche ora

source: Process started
it: Processo iniziato

source: An error occurred in background process.
it: Si è verificato un errore nel processo in background.

source: Process ended succesfully
it: Processo terminato positivamente

source: Bulk Metadata edition cannot be started because no field is selected for editing.
it: La modifica massiva di metadati non può iniziare perché nessun campo è stato selezionato.

source: Bulk Metadata edition cannot be started because no editing type is selected.
it: La modifica massiva di metadati non può iniziare perché nessun tipo di modifica è stato selezionato.

source: Bulk Metadata edition has been processed.
it: La modifica Bulk Metadata è stata eseguita.

source: The requested changes are applied to the database one by one in the background.
it: Le modifiche richieste sono applicate alla base dati una ad una in background.

source: Check logs for success and errors.
it: Controlla i registri per successi ed errori.

source: is exactly
it: è esattamente

source: is not exactly
it: non è esattamente

source: starts with
it: comincia con

source: ends with
it: finisce con

source: matches
it: corrisponde a

source: does not match
it: non corrisponde a

source: Only select items which also meet the following criteria:
it: Seleziona solamente documenti che corrispondono anche ai seguenti criteri:

source: Input search term here
it: Inserisci qui il termine da cercare

source: Match Case
it: Maiuscole/minuscole

source: Add Another Rule
it: Aggiungi un'altra regola

source: Invalid search type given!
it: Tipologia di ricerca non valida!

source: Cannot pull item data from a non-item.
it: Non si possono recuperare dati documento da un non-documento.

source: [untitled]
it: [senza titolo]

source: [no description given]
it: [nessuna descrizione fornita]

source: [undefined]
it: [indefinito]

source: [BulkMetadataEditor] [%s] item #%d:
it: [BulkMetadataEditor] [%s] documento #%d:

source: Please define search and replace terms.
it: Si prega di indicare i termini da cercare e da sostituire.

source: Search and replace terms coincide.
it: I termini da cercare e da sostituire coincidono.

source: An error occurred: %s
it: Si è verificato un errore: %s

source: Please input some text to add.
it: Si prega di indicare del testo da aggiungere.

source: Please input some text to prepend.
it: Si prega di indicare del testo da anteporre.

source: Please input some text to append.
it: Si prega di scegliere una tipologia di conversione

source: Please input a separator to explode texts.
it: Si prega di indicare un separatore per separare i testi.

source: Please input a separator to join texts.
it: Si prega di indicare un separatore per unire i testi.

source: Error retrieving item data for joining.
it: Errore nel recupero dei dati da unire.

source: Error retrieving item data for deduplication.
it: Errore nel recupero dei dati documento per l'eliminazione di duplicati.

source: Error retrieving item data for deletion.
it: Errore nel recupero dei dati documenti da cancellare.

source: Success.
it: Successo.
